# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Binaries
brew 'azure-cli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'httpie'
brew 'nmap'
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'terraform'
brew 'yarn'

# Apps
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
