# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Binaries
brew 'azure-cli'
brew 'git'
brew 'httpie'
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'yarn'

# Apps
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'visual-studio-code'
cask 'whatsapp'

# Remove outdated versions from the cellar.
brew cleanup